#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

data.aws_caller_identity.current: Reading...
aws_kms_key.local_key: Refreshing state... [id=2c6becc8-7862-4c87-8c5f-990a766aca67]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_secretsmanager_secret.db_secrets: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:environment/secrets-2owIkb]
aws_secretsmanager_secret.secret_one: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:secure_secret_one-JiRe9Q]
aws_secretsmanager_secret_version.secure_one_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:secure_secret_one-JiRe9Q|050AA98F-D453-4075-9EF8-F6BA9C1B7A80]
aws_secretsmanager_secret_version.db_secrets_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:environment/secrets-2owIkb|C51777E5-9680-462A-AB90-18DB52F1FD47]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.key will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/secret-encryption"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "2c6becc8-7862-4c87-8c5f-990a766aca67"
    }

  # aws_kms_key_policy.encrypt_kms will be created
  + resource "aws_kms_key_policy" "encrypt_kms" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = "2c6becc8-7862-4c87-8c5f-990a766aca67"
      + policy                             = jsonencode(
            {
              + Id        = "encrypt-secretsmanager"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:CreateGrant",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount" = "743794601996"
                              + "kms:ViaService"    = "secretsmanager.us-east-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "*",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access through AWS Secrets Manager for all principals in the account that are authorized to use AWS Secrets Manager"
                    },
                  + {
                      + Action    = "kms:GenerateDataKey*"
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount" = "743794601996"
                            }
                          + StringLike   = {
                              + "kms:ViaService" = "secretsmanager.us-east-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "*",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access through AWS Secrets Manager for all principals in the account that are authorized to use AWS Secrets Manager"
                    },
                  + {
                      + Action    = [
                          + "kms:Describe*",
                          + "kms:Get*",
                          + "kms:List*",
                          + "kms:RevokeGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::743794601996:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow direct access to key metadata to the account"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*